{
    "<BLANK>": 0,
    "<PAD>": 1,
    "<UNK>": 2,
    "\t": 3,
    "\n": 4,
    " ": 5,
    "!": 6,
    "\"": 7,
    "'": 8,
    "(": 9,
    ")": 10,
    "*": 11,
    ",": 12,
    "-": 13,
    ".": 14,
    "/": 15,
    ":": 16,
    "<": 17,
    ">": 18,
    "\\": 19,
    "|": 20,
    "؁": 21,
    "،": 22,
    "ؓ": 23,
    "ؔ": 24,
    "؛": 25,
    "؟": 26,
    "ء": 27,
    "آ": 28,
    "أ": 29,
    "ؤ": 30,
    "إ": 31,
    "ئ": 32,
    "ا": 33,
    "ب": 34,
    "ة": 35,
    "ت": 36,
    "ث": 37,
    "ج": 38,
    "ح": 39,
    "خ": 40,
    "د": 41,
    "ذ": 42,
    "ر": 43,
    "ز": 44,
    "س": 45,
    "ش": 46,
    "ص": 47,
    "ض": 48,
    "ط": 49,
    "ظ": 50,
    "ع": 51,
    "غ": 52,
    "ـ": 53,
    "ف": 54,
    "ق": 55,
    "ك": 56,
    "ل": 57,
    "م": 58,
    "ن": 59,
    "ه": 60,
    "و": 61,
    "ى": 62,
    "ي": 63,
    "ً": 64,
    "ٌ": 65,
    "ٍ": 66,
    "َ": 67,
    "ُ": 68,
    "ِ": 69,
    "ّ": 70,
    "ْ": 71,
    "ٓ": 72,
    "ٔ": 73,
    "٠": 74,
    "١": 75,
    "٢": 76,
    "٣": 77,
    "٤": 78,
    "٥": 79,
    "٦": 80,
    "٧": 81,
    "٨": 82,
    "٩": 83,
    "٫": 84,
    "٬": 85,
    "ٰ": 86,
    "ٸ": 87,
    "ٹ": 88,
    "ټ": 89,
    "پ": 90,
    "ځ": 91,
    "څ": 92,
    "چ": 93,
    "ډ": 94,
    "ړ": 95,
    "ږ": 96,
    "ژ": 97,
    "ښ": 98,
    "ک": 99,
    "ګ": 100,
    "ں": 101,
    "ڼ": 102,
    "ھ": 103,
    "ۀ": 104,
    "ہ": 105,
    "ۃ": 106,
    "ی": 107,
    "ۍ": 108,
    "ې": 109,
    "ے": 110,
    "ۓ": 111,
    "۔": 112,
    "ە": 113,
    "ۖ": 114,
    "۰": 115,
    "۱": 116,
    "۲": 117,
    "۳": 118,
    "۴": 119,
    "۵": 120,
    "۶": 121,
    "۷": 122,
    "۸": 123,
    "۹": 124,
    "‌": 125,
    "‍": 126,
    "‎": 127,
    "‏": 128,
    "–": 129,
    "‘": 130,
    "’": 131,
    "“": 132,
    "”": 133,
    "•": 134,
    "ﭘ": 135,
    "ﮐ": 136,
    "ﯥ": 137,
    "ﯼ": 138,
    "ﯾ": 139,
    "ﷲ": 140,
    "ﺀ": 141,
    "ﺉ": 142,
    "ﺍ": 143,
    "ﺎ": 144,
    "ﺏ": 145,
    "ﺑ": 146,
    "ﺗ": 147,
    "ﺘ": 148,
    "ﺛ": 149,
    "ﺟ": 150,
    "ﺧ": 151,
    "ﺩ": 152,
    "ﺪ": 153,
    "ﺬ": 154,
    "ﺭ": 155,
    "ﺮ": 156,
    "ﺯ": 157,
    "ﺳ": 158,
    "ﺷ": 159,
    "ﺸ": 160,
    "ﻋ": 161,
    "ﻏ": 162,
    "ﻓ": 163,
    "ﻖ": 164,
    "ﻠ": 165,
    "ﻡ": 166,
    "ﻢ": 167,
    "ﻣ": 168,
    "ﻥ": 169,
    "ﻧ": 170,
    "ﻨ": 171,
    "ﻪ": 172,
    "ﻫ": 173,
    "ﻬ": 174,
    "ﻭ": 175,
    "ﻮ": 176,
    "ﻲ": 177,
    "ﻻ": 178,
    "ﻼ": 179,
    "﻿": 180
}